// [1] 데이터와 타입입
3;           // - 숫자타입의 데이터 3
3.14;        // - 숫자타입의 데이터 3.14
123456;      // - 숫자타입의 데이터 123456;
'안녕 JS1';  // - 문자열타입의 데이터
"안녕 JS2";  // - 문자열타입의 데이터
`안녕 JS3`;  // - `` 백틱 = 문자열
true;        // - 논리타입
false;       // - 논리타입
             // JS는 실수와 정수를 Number타입으로 관리한다.

// [2] 콘솔 출력하기
console.log(3);
console.log("안녕 JS1");
console.log('안녕 JS2');
console.log(`안녕 JS3`);
console.log(true)

// [출력 예시]
console.log(`\\    /\\ \n )  ( \`) \n(  \\  )\n \\(__)/ `)

// [3] 브라우저에서 입력받기
prompt("[안내] 안녕하세요, 아무거나 입력하세요.");